Tekla Open API Reference for Tekla Structures 2025
AutoDrawingRule.Filename Property
 The filename of the AutoDrawing script.
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Filename { get; set; }
Public Property Filename As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AutoDrawingRule Class
Tekla.Structures.Drawing.Automation Namespace